Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/carers_leave_from_employment.html.txt.tmx
Source language: en
Languages: ga

source: • Where the employee is no longer in a position to provide full-time care and attention
ga: • Sa chás nach bhfuil sé de chumas an fhostaí cúram agus aird lánaimseartha a chur ar fáil níos mó

source: • Where the person being cared for dies
ga: • Sa chás go bhfaigheann an duine faoi chúram bás

source: In these circumstances, the carer’s leave will end 6 weeks after the death or on the date
ga: Sna himthosca seo, tiocfaidh deireadh leis an saoire cúramóra 6 seachtaine tar éis an bháis nó ar an dáta a shonraítear sa doiciméad dearbhaithe – cibé acu is luaithe

source: specified in the confirmation document – whichever is earlier • Where an employer is of the opinion that the employee, or the person receiving the care, no longer meets the conditions for carer’s leave
ga: • Sa chás go bhfuil fostóir den tuairim nach gcomhlíonann an fostaí, nó an duine atá ag fáil an chúraim, na coinníollacha do shaoire cúramóra a thuilleadh

source: In such a situation, the employer may refer the matter to the Department of Social Protection for a decision
ga: Sa chás seo, is féidir leis an bhfostóir an cheist a chur faoi bhráid na Roinne Coimirce Sóisialaí chun cinneadh a fháil

source: Following the ending of the carer’s leave, the employer must give notice of this fact (including the date of return) in writing to the Department of Social Protection
ga: Tar éis deireadh a bheith curtha leis an saoire cúramóra, ní mór don fhostóir fógra faoin méid sin (lena n-áirítear an dáta fillte) a thabhairt i scríbhinn don Roinn Coimirce Sóisialaí
